<template>
  <div class="box">
    <el-dialog title="简介"  :visible.sync="dialogVisible" width="30%" :before-close="handleClose"  :append-to-body='true'>
      <span>{{contents[current].name}}</span>
      <div>
          {{contents[current].detail}}
      </div>
      <span slot="footer" class="dialog-footer">
        <!-- <el-button @click="dialogVisible = false">取 消</el-button> -->
        <el-button type="primary" @click="dialogVisible = false">确 定</el-button>
      </span>
    </el-dialog>

    <div class="show-title">
      <span>无情病魔，有道义士</span>
    </div>

    <div class="show-box">
      <div class="box-item" v-for="(content,index) in contents" :key="index">
        <el-popover
          placement="top-start"
          :title="content.name"
          width="200"
          trigger="hover"
          :content="content.detail"
        >
          <el-button class="radius" @click="buttonClick(index)" slot="reference">{{content.name}}</el-button>
        </el-popover>
      </div>
    </div>
    <div class="show-button">
      <el-button id="start">点击滑块查看生平</el-button>
    </div>
  </div>
</template>

<script>
import featureView from "../../common/FeatureView";
export default {
  name: "indexShow11",
  data() {
    return {
      contents: [
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        },
        {
          name: "李文亮",
          detail: `中共党员，湖北省武汉市中心医院眼科医生。2020年1月8日，李医生在接诊时遇到不明原因的病毒性肺炎患者并受到感染。2月7日凌晨2点58分，李医生病情突然恶化，经全力抢救无效去世，时年34岁。`
        }
      ],
      dialogVisible: false,
      current:0
    };
  },
  components: {
    featureView
  },
  methods: {
    handleClose(done) {
      this.$confirm("确认关闭？")
        .then(_ => {
          done();
        })
        .catch(_ => {});
    },
    buttonClick(index){
        this.dialogVisible = true;
        this.current=index;
    }
  }
};
</script>

<style scoped>
.place {
  text-align: center;
}
.el-steps {
  width: 50%;
}
.show-box {
  display: flex;
  flex-wrap: wrap;
  height: 62vh;
  padding: 15px 300px;
  overflow-y: scroll;
}
.box-item {
  flex: 1;
}
.radius {
  margin: 10px;
  width: 100px;
  height: 100px;
  border-radius: 50%;
  box-shadow: 2px 2px 2px #888888;
  background-color: #3498db;
  color: #fefefe;
}
/* .el-button {
  margin: 10px;
  width: 100px;
  height: 100px;
  border-radius: 50%;
  box-shadow: 2px 2px 2px #888888;
  background-color: #3498db;
  color: #fefefe;
} */
.show-title {
  font-size: 30px;
  height: 10vh;
  line-height: 10vh;
  color: #888888;
}
.show-button {
  padding: 50px;
}
#start {
  height: 50px;
  width: 200px;
  border-radius: 0;
}
</style>
